823984418/hc32f448_pac/svd/HC32F448_patch.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>DCU1</name>
            <description>desc DCU</description>
            <baseAddress>0x40056000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>DCU1_Handler</name>
                <value>42</value>
            </interrupt>
            <interrupt>
                <name>DCU2_Handler</name>
                <value>43</value>
            </interrupt>
            <interrupt>
                <name>DCU3_Handler</name>
                <value>44</value>
            </interrupt>
            <interrupt>
                <name>DCU4_Handler</name>
                <value>45</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTL</name>
                    <description>desc CTL</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x80000000</resetValue>
                    <resetMask>0x8000013F</resetMask>
                    <fields>
                        <field>
                            <name>MODE</name>
                            <description>desc MODE</description>
                            <msb>3</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DATASIZE</name>
                            <description>desc DATASIZE</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>COMPTRG</name>
                            <description>desc COMPTRG</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INTEN</name>
                            <description>desc INTEN</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FLAG</name>
                    <description>desc FLAG</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE7F</resetMask>
                    <fields>
                        <field>
                            <name>FLAG_OP</name>
                            <description>desc FLAG_OP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FLAG_LS2</name>
                            <description>desc FLAG_LS2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FLAG_EQ2</name>
                            <description>desc FLAG_EQ2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FLAG_GT2</name>
                            <description>desc FLAG_GT2</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FLAG_LS1</name>
                            <description>desc FLAG_LS1</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FLAG_EQ1</name>
                            <description>desc FLAG_EQ1</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FLAG_GT1</name>
                            <description>desc FLAG_GT1</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FLAG_RLD</name>
                            <description>desc FLAG_RLD</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FLAG_BTM</name>
                            <description>desc FLAG_BTM</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>FLAG_TOP</name>
                            <description>desc FLAG_TOP</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATA0</name>
                    <description>desc DATA0</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DATA1</name>
                    <description>desc DATA1</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>DATA2</name>
                    <description>desc DATA2</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                </register>
                <register>
                    <name>FLAGCLR</name>
                    <description>desc FLAGCLR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xE7F</resetMask>
                    <fields>
                        <field>
                            <name>CLR_OP</name>
                            <description>desc CLR_OP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLR_LS2</name>
                            <description>desc CLR_LS2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLR_EQ2</name>
                            <description>desc CLR_EQ2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLR_GT2</name>
                            <description>desc CLR_GT2</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLR_LS1</name>
                            <description>desc CLR_LS1</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLR_EQ1</name>
                            <description>desc CLR_EQ1</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLR_GT1</name>
                            <description>desc CLR_GT1</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLR_RLD</name>
                            <description>desc CLR_RLD</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLR_BTM</name>
                            <description>desc CLR_BTM</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>CLR_TOP</name>
                            <description>desc CLR_TOP</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTEVTSEL</name>
                    <description>desc INTEVTSEL</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xDFF</resetMask>
                    <fields>
                        <field>
                            <name>SEL_OP</name>
                            <description>desc SEL_OP</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL_LS2</name>
                            <description>desc SEL_LS2</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL_EQ2</name>
                            <description>desc SEL_EQ2</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL_GT2</name>
                            <description>desc SEL_GT2</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL_LS1</name>
                            <description>desc SEL_LS1</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL_EQ1</name>
                            <description>desc SEL_EQ1</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL_GT1</name>
                            <description>desc SEL_GT1</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL_WIN</name>
                            <description>desc SEL_WIN</description>
                            <msb>8</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL_BTM</name>
                            <description>desc SEL_BTM</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SEL_TOP</name>
                            <description>desc SEL_TOP</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
