823984418/hc32f448_pac/svd/HC32F448_patch.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>INTC</name>
            <description>desc INTC</description>
            <baseAddress>0x40051000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0xE8</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>IRQ000_Handler</name>
                <value>0</value>
            </interrupt>
            <interrupt>
                <name>IRQ001_Handler</name>
                <value>1</value>
            </interrupt>
            <interrupt>
                <name>IRQ002_Handler</name>
                <value>2</value>
            </interrupt>
            <interrupt>
                <name>IRQ003_Handler</name>
                <value>3</value>
            </interrupt>
            <interrupt>
                <name>IRQ004_Handler</name>
                <value>4</value>
            </interrupt>
            <interrupt>
                <name>IRQ005_Handler</name>
                <value>5</value>
            </interrupt>
            <interrupt>
                <name>IRQ006_Handler</name>
                <value>6</value>
            </interrupt>
            <interrupt>
                <name>IRQ007_Handler</name>
                <value>7</value>
            </interrupt>
            <interrupt>
                <name>IRQ008_Handler</name>
                <value>8</value>
            </interrupt>
            <interrupt>
                <name>IRQ009_Handler</name>
                <value>9</value>
            </interrupt>
            <interrupt>
                <name>IRQ010_Handler</name>
                <value>10</value>
            </interrupt>
            <interrupt>
                <name>IRQ011_Handler</name>
                <value>11</value>
            </interrupt>
            <interrupt>
                <name>IRQ012_Handler</name>
                <value>12</value>
            </interrupt>
            <interrupt>
                <name>IRQ013_Handler</name>
                <value>13</value>
            </interrupt>
            <interrupt>
                <name>IRQ014_Handler</name>
                <value>14</value>
            </interrupt>
            <interrupt>
                <name>IRQ015_Handler</name>
                <value>15</value>
            </interrupt>
            <interrupt>
                <name>EXTINT00_SWINT16_Handler</name>
                <value>16</value>
            </interrupt>
            <interrupt>
                <name>EXTINT01_SWINT17_Handler</name>
                <value>17</value>
            </interrupt>
            <interrupt>
                <name>EXTINT02_SWINT18_Handler</name>
                <value>18</value>
            </interrupt>
            <interrupt>
                <name>EXTINT03_SWINT19_Handler</name>
                <value>19</value>
            </interrupt>
            <interrupt>
                <name>EXTINT04_SWINT20_Handler</name>
                <value>20</value>
            </interrupt>
            <interrupt>
                <name>EXTINT05_SWINT21_Handler</name>
                <value>21</value>
            </interrupt>
            <interrupt>
                <name>EXTINT06_SWINT22_Handler</name>
                <value>22</value>
            </interrupt>
            <interrupt>
                <name>EXTINT07_SWINT23_Handler</name>
                <value>23</value>
            </interrupt>
            <interrupt>
                <name>EXTINT08_SWINT24_Handler</name>
                <value>24</value>
            </interrupt>
            <interrupt>
                <name>EXTINT09_SWINT25_Handler</name>
                <value>25</value>
            </interrupt>
            <interrupt>
                <name>EXTINT10_SWINT26_Handler</name>
                <value>26</value>
            </interrupt>
            <interrupt>
                <name>EXTINT11_SWINT27_Handler</name>
                <value>27</value>
            </interrupt>
            <interrupt>
                <name>EXTINT12_SWINT28_Handler</name>
                <value>28</value>
            </interrupt>
            <interrupt>
                <name>EXTINT13_SWINT29_Handler</name>
                <value>29</value>
            </interrupt>
            <interrupt>
                <name>EXTINT14_SWINT30_Handler</name>
                <value>30</value>
            </interrupt>
            <interrupt>
                <name>EXTINT15_SWINT31_Handler</name>
                <value>31</value>
            </interrupt>
            <interrupt>
                <name>EVENT_PORT1_Handler</name>
                <value>100</value>
            </interrupt>
            <interrupt>
                <name>EVENT_PORT2_Handler</name>
                <value>101</value>
            </interrupt>
            <interrupt>
                <name>EVENT_PORT3_Handler</name>
                <value>102</value>
            </interrupt>
            <interrupt>
                <name>EVENT_PORT4_Handler</name>
                <value>103</value>
            </interrupt>
            <registers>
                <register>
                    <name>NMIER</name>
                    <description>desc NMIER</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF2E</resetMask>
                    <fields>
                        <field>
                            <name>SWDTEN</name>
                            <description>desc SWDTEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1EN</name>
                            <description>desc PVD1EN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2EN</name>
                            <description>desc PVD2EN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTPEN</name>
                            <description>desc XTALSTPEN</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RPARERREN</name>
                            <description>desc RPARERREN</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RECCERREN</name>
                            <description>desc RECCERREN</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSERREN</name>
                            <description>desc BUSERREN</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDTEN</name>
                            <description>desc WDTEN</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NMIFR</name>
                    <description>desc NMIFR</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF2E</resetMask>
                    <fields>
                        <field>
                            <name>SWDTF</name>
                            <description>desc SWDTF</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1F</name>
                            <description>desc PVD1F</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2F</name>
                            <description>desc PVD2F</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTPF</name>
                            <description>desc XTALSTPF</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RPARERRF</name>
                            <description>desc RPARERRF</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RECCERRF</name>
                            <description>desc RECCERRF</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSERRF</name>
                            <description>desc BUSERRF</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDTF</name>
                            <description>desc WDTF</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NMIFCR</name>
                    <description>desc NMIFCR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xF2E</resetMask>
                    <fields>
                        <field>
                            <name>SWDTFCLR</name>
                            <description>desc SWDTFCLR</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD1FCLR</name>
                            <description>desc PVD1FCLR</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PVD2FCLR</name>
                            <description>desc PVD2FCLR</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTALSTPFCLR</name>
                            <description>desc XTALSTPFCLR</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RPARERRFCLR</name>
                            <description>desc RPARERRFCLR</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RECCERRFCLR</name>
                            <description>desc RECCERRFCLR</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BUSERRFCLR</name>
                            <description>desc BUSERRFCLR</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDTFCLR</name>
                            <description>desc WDTFCLR</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR0</name>
                    <description>desc EIRQCR0</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR1</name>
                    <description>desc EIRQCR1</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR2</name>
                    <description>desc EIRQCR2</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>EIRQCR3</name>
                    <description>desc EIRQCR3</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xB0B3</resetMask>
                    <fields>
                        <field>
                            <name>EIRQTRG</name>
                            <description>desc EIRQTRG</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EISMPCLK</name>
                            <description>desc EISMPCLK</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EFEN</name>
                            <description>desc EFEN</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCSEL</name>
                            <description>desc NOCSEL</description>
                            <msb>13</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NOCEN</name>
                            <description>desc NOCEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
